export default function InstPostDetails({ onClose }) {
  return (
    <div
      className="fixed inset-0 z-50 bg-opacity-30 backdrop-blur-sm"
      onClick={() => onClose()}
    >
      <div className="flex justify-center items-center shadow-lg w-full m-auto p-6 h-screen">
        <div
          className="bg-crema flex flex-row gap-6 rounded-2xl m-50 p-6 shadow-xl transition-all"
        >
          <div className="bg-ochre p-2 rounded-xl w-100 h-100">
            <img
              className="rounded-xl object-cover"
              src="https://placehold.co/400"
              alt="placeholder"
            />
          </div>
          <p className="mt-4 w-3/4">
            Казковий Дім🤍 @kazkovyidim.cv Скільки любові, тепла та світла в
            одній лише назві. Назва, яку не потрібно було довго шукати, її
            одразу відчула всередині, в душі та серці. Моя робота, моя улюблена
            справа,ця прекрасна сфера й наша команда неймовірних чарівників - це
            те, що стало невід‘ємною частинкою формування моєї особистості, тієї
            Софи, якою я є зараз - наповненої любов‘ю, добром та світлом до
            всього світу, завжди з вірою у найкраще, з вірою у здійснення усіх
            мрій, Софи, яка безмежно, всім серцем любить діток, в компанії з
            якими відчуває себе «вдома»🫂🏡 Попереду ще так багато прекрасного й
            нового: розвитку, ідей, навчання, натхнення, цілей. Відчуваю себе
            щасливою і завжди-завжди буду безмежно вдячною за свій шлях, за
            можливості, за те, що колись познайомилась із сферою організації
            дитячих свят - джерелом любові та добра✨ Цього року вже розпочинаю
            ще одну «казкову історію», але вже і в Іспанії - @casadecuentos.es
            ,Казковий Дім даруватиме удвічі більше щирої радості та спогадів.
            Вірю в себе, вірю, що все обов‘язково вийде, вірю в нові прекрасні
            зустрічі та зв‘язок із усіма дітками на шляху Casa de Cuentos і
            Казкового Дому🪄🫶🥹 З любов‘ю та душею створимо справжнісіньку
            казку для ваших діток 🪄 @kazkovyidim.cv @casadecuentos.es
          </p>
        </div>
      </div>
    </div>
  );
}
